## Plan Result (Managed_Identity)




<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_user_assigned_identity.wi-admin-mi
* Update
  * azurerm_resource_group.application-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.application-mi will be updated in-place
  ~ resource "azurerm_resource_group" "application-mi" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/managed-identities-sbox-rg"
        name     = "managed-identities-sbox-rg"
      ~ tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_user_assigned_identity.wi-admin-mi will be created
  + resource "azurerm_user_assigned_identity" "wi-admin-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "admin-sbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-sbox-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + tenant_id           = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":517,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity","Vars":{}} -->